### Tests

```bash
~/projects/regitrack/terraform (feature/terraform-ecr-cluster)% terraform apply
aws_vpc.main: Refreshing state... [id=vpc-0b9cbdfceff542bb3]
aws_internet_gateway.main: Refreshing state... [id=igw-07995718a0e510a6b]
aws_subnet.public_b: Refreshing state... [id=subnet-03811783026c76644]
aws_subnet.public_a: Refreshing state... [id=subnet-0ba6b2e8db6053ac0]
aws_route_table.public: Refreshing state... [id=rtb-02439f54c67548dae]
aws_route_table_association.public_b: Refreshing state... [id=rtbassoc-0220c2c8e74e8fe7c]
aws_route_table_association.public_a: Refreshing state... [id=rtbassoc-0b835e32b2367d229]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the
following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_repository.api will be created
  + resource "aws_ecr_repository" "api" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "regitrack-api"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name" = "regitrack-api-repo"
        }
      + tags_all             = {
          + "Name" = "regitrack-api-repo"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.nginx will be created
  + resource "aws_ecr_repository" "nginx" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "regitrack-nginx"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name" = "regitrack-nginx-repo"
        }
      + tags_all             = {
          + "Name" = "regitrack-nginx-repo"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecs_cluster.main will be created
  + resource "aws_ecs_cluster" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "regitrack-cluster"
      + tags     = {
          + "Name" = "regitrack-cluster"
        }
      + tags_all = {
          + "Name" = "regitrack-cluster"
        }

      + setting (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_ecr_repository_url   = (known after apply)
  + ecs_cluster_name         = "regitrack-cluster"
  + nginx_ecr_repository_url = (known after apply)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_ecr_repository.api: Creating...
aws_ecs_cluster.main: Creating...
aws_ecr_repository.nginx: Creating...
aws_ecr_repository.nginx: Creation complete after 3s [id=regitrack-nginx]
aws_ecr_repository.api: Creation complete after 3s [id=regitrack-api]
aws_ecs_cluster.main: Still creating... [00m10s elapsed]
aws_ecs_cluster.main: Creation complete after 12s [id=arn:aws:ecs:us-east-1:215288576473:cluster/regitrack-cluster]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

Outputs:

api_ecr_repository_url = "215288576473.dkr.ecr.us-east-1.amazonaws.com/regitrack-api"
ecs_cluster_name = "regitrack-cluster"
nginx_ecr_repository_url = "215288576473.dkr.ecr.us-east-1.amazonaws.com/regitrack-nginx"
public_subnet_ids = [
  "subnet-0ba6b2e8db6053ac0",
  "subnet-03811783026c76644",
]
vpc_id = "vpc-0b9cbdfceff542bb3"
```